{"context": "The <redaction 1> Katay D. Sasorith is the most powerful individual in the cabinet. He is vice premier and holds both Defense and Interior portfolios. His <redaction 2> judging from his past performance, he is unlikely to undertake a vigorous reform of the security forces and provincial administration. He opposes a drastic monetary reform desired by the United States and will be able to exert heavy pressure during negotiations.", "redactions": ["notoriously corrupt and discredited", "leading role associates the new government with the corruption of its predecessor and,"], "example_id": 0, "redacted_path": "images/0_redacted.png", "unredacted_path": "images/0_unredacted.png", "page": 9, "doc_id_r": "CIA-RDP79T00975A003900150001-2", "doc_id_u": 3169517, "date": "August 19, 1958"}
{"context": "Venezuelan Military Coup Fails The failure of a Venezuelan military coup on 7 September reflects the loyalty of the majority of the armed forces to junta President Larrazabal and the effectiveness of civilian strength as a check against a return to military rule. The revolt, which apparently was quickly suppressed, was led by officers recently exiled for involvement in the coup <redaction 1>. An elaborate civilian organization has been developed since the ouster of dictator Perez last January to ensure the election of a constitutional regime next November and to guard against future military dominance of the government. It consists of labor, student, and political groups, some of which are armed and all of which can be mobilized rapidly for a display of force. The responsible top leaders in the structure may not in the future be able to control the radical and unruly elements, which could convert the organization into a force of anarchy and violence.", "redactions": ["reportedly planned by former Defense Minister Castro Leon on 22 and 23 July"], "example_id": 1, "redacted_path": "images/1_redacted.png", "unredacted_path": "images/1_unredacted.png", "page": 14, "doc_id_r": "CIA-RDP79T00975A003900330001-2", "doc_id_u": 3156627, "date": "September 8, 1958"}
{"context": "Iraqi Struggle for Power Breaks Into Open The removal of pro-Nasir Vice Premier Arif from his post as deputy commander of the Iraqi armed forces appears to be the first overt move in the power struggle between pro-Arif and pro-Qasim factions in the ruling clique. Arif, who still retains his posts as deputy premier and minister of interior, presumably has been effectively cut off from the direct chain of command in the army. <redaction 1> Nasir has indicated his support of Arif and will probably be alarmed that he is apparently losing ground. He may contend that the removal of Arif, whom he claims to be the only Iraqi capable of combating Communist influence, is a victory for the pro-Soviet and anti-UAR faction. This claim could serve Nasir as an excuse for active interference in Iraqi affairs.", "redactions": ["Arif was planning a coup against Prime Minister Qasim, who may have learned of Arif’s plans and moved first."], "example_id": 2, "redacted_path": "images/2_redacted.png", "unredacted_path": "images/2_unredacted.png", "page": 14, "doc_id_r": "CIA-RDP79T00975A004000020001-4", "doc_id_u": 2996628, "date": "September 13, 1958"}
{"context": "Nasir Facing New Difficulties Nasir has received the resignation of Egyptian Vice President for Economic Affairs Abd al-Latif Baghdadi, but has not as yet indicated that he will accept it. Baghdadi, a member of the original Revolutionary Command Council and one of the regime's most competent officials, has been accused of profiteering, following an official investigation presumably ordered by Nasir. Acceptance of the popular Baghdadi's resignation, combined with present rumors of a serious misunderstanding between Nasir and his chief adviser, Ali Sabri, would probably lower the regime's prestige and add to public discontent. <redaction 1> Differences between Nasir and members of his revolutionary group have been common, but they have usually been settled with a minimum of publicity and little effect on the regime's stability. It is unlikely that the current difficulties will have a significantly different result; however, they add to the mounting number of problems Nasir is facing.", "redactions": ["Egyptian Marshal Amir is reported attempting to bring about a reconciliation."], "example_id": 3, "redacted_path": "images/3_redacted.png", "unredacted_path": "images/3_unredacted.png", "page": 9, "doc_id_r": "CIA-RDP79T00975A004000110001-4", "doc_id_u": 2996634, "date": "September 24, 1958"}
{"context": "Taiwan Strait Situation Chinese Nationalist officials are making every effort to offset the effects of Communist China's cease-fire offer. <redaction 1> Chiang Kai-shek told British newsmen on 6 October that the Warsaw talks should be broken off to test Peiping's reaction. A Nationalist military spokesman publicly dismissed the Communist offer to suspend shelling for a week as \"purely international propaganda.\"", "redactions": ["One ranking Nationalist leader told an American official on 6 October that his government views the move as a threefold attempt to divide Taipei and Washington, to weaken the morale of the troops on Chinmen, and to provide a means to charge the United States with forcing hostilities, possibly as a prelude to a major assault."], "example_id": 4, "redacted_path": "images/4_redacted.png", "unredacted_path": "images/4_unredacted.png", "page": 8, "doc_id_r": "CIA-RDP79T00975A004000220001-2", "doc_id_u": 3003300, "date": "October 7, 1958"}
{"context": "Communist-indoctrinated Leaders Return to Syria and Iraq Syrian Communist leader Khalid Bakdash and Iraqi Kurdish dissident Mulla Mustafa Barzani have returned from the Soviet bloc. Bakdash, who like Barzani is of Kurdish origin, led his party in opposition to Egyptian-Syrian union and left Syria for Prague and the USSR at the time of the UAR's formation last February. He reportedly returned to Damascus on 5 October. Barzani, who returned to Baghdad on 6 October, had been in the USSR since leading an unsuccessful Kurdish rebellion against Iraq and Iran in 1946. He stopped first at Cairo on 3 October, where he met with Nasir. Nasir's current efforts to strengthen his control over Syrian affairs and to bring Iraq into the UAR orbit could be sabotaged by the activities of Bakdash, Barzani, and their followers. Nasir is reported recently to have expressed fear of such sabotage to Soviet presidium member <redaction 1>. The Syrian Communists are encouraging anti-UAR feeling within Syria and are probably in contact with the Iraqi Communists, who are also opposing Cairo's influence. The large Kurdish minorities in Iraq and Syria may be brought into opposition to the UAR by the promise of an independent Kurdish state, and Barzani's presence will probably heighten such feeling. Nasir, nevertheless, may hesitate to move directly against men of the stature of Bakdash and Barzani.", "redactions": ["Mukhitdinov"], "example_id": 5, "redacted_path": "images/5_redacted.png", "unredacted_path": "images/5_unredacted.png", "page": 14, "doc_id_r": "CIA-RDP79T00975A004000230001-1", "doc_id_u": 2998382, "date": "October 8, 1958"}
{"context": "Pressures Growing for Reshuffle of Moroccan Government Discontent with the present Moroccan Government, including the King's <redaction 1> has grown to such an extent among left-wing elements in the dominant Istiqlal party that the well-informed Tunisian ambassador believes the long-anticipated cabinet reshuffle is imminent. The ambassador expects moderate Prime Minister Balafrej to retain his office, but believes Istiqlal extremists like Ibrahim, Ben Barka, and Bouabid will increase their influence in the cabinet. <redaction 2> Istiqlal extremists are particularly critical of the cabinet's lack of control over the army and security forces, which are under the King's jurisdiction. Their request for a change in this control was rejected by the King recently after the issue was highlighted by the anti-Istiqlal activities of a rival party in the Rif mountain area. Istiqlal leaders consider that the director of national security was slow in acting against this party's terrorism. They also accuse him of playing off one Istiqlal faction against another.", "redactions": ["authoritarian position, has grown to such an extent among left-wing elements", "One report states that a decision to resign was actually reached by the government on 18 October and that the resignation will be announced on 20 October."], "example_id": 6, "redacted_path": "images/6_redacted.png", "unredacted_path": "images/6_unredacted.png", "page": 12, "doc_id_r": "CIA-RDP79T00975A004000330001-0", "doc_id_u": 2998389, "date": "October 20, 1958"}
{"context": "Tunis Blames France for Jamming Broadcasts The jamming station which is interfering with Arab-language broadcasts of Radio Tunis has been pinpointed at Collo, near Philippeville in eastern Algeria, <redaction 1> The French Embassy in Tunis denies that France is responsible, but French military authorities in eastern Algeria may be conducting a local operation to prevent Algerians--and consequently other listeners--from receiving this station. In accordance with Tunisia's policy, its broadcasts support Algerian independence, the National Liberation Front, and the provisional government.", "redactions": ["by British naval units at Malta."], "example_id": 7, "redacted_path": "images/7_redacted.png", "unredacted_path": "images/7_unredacted.png", "page": 11, "doc_id_r": "CIA-RDP79T00975A004200040001-0", "doc_id_u": 2998397, "date": "December 6, 1958"}
{"context": "Burmese Army's Political Activities and Plans Col. Maung Maung, an influential army officer who is one of General Ne Win's closest political advisers, <redaction 1> stated recently that six months was too short a time in which to establish stability in Burma, and that it would be impossible to hold elections before 1960. Maung Maung indicated that the army was searching for \"constitutional\" means of extending the tenure of the Ne Win government beyond the six-month period stipulated under the terms of the \"transfer of power\" agreement which enabled Ne Win to come to power with a semblance of constitutionality in late October. The general tenor of Maung Maung's remarks suggests that the army is determined to remain in power indefinitely beyond the achievement of its stated objectives of pacifying the country and limiting the Communist threat.", "redactions": ["is reliably reported to have"], "example_id": 8, "redacted_path": "images/8_redacted.png", "unredacted_path": "images/8_unredacted.png", "page": 12, "doc_id_r": "CIA-RDP79T00975A004200120001-1", "doc_id_u": 3010219, "date": "December 16, 1958"}
{"context": "Moslem Feuding May Cause Lebanese Cabinet Crisis The Lebanese Army's strong action last week end against former rebel Sunni Moslem villagers in the Biqa Valley is likely to arouse a storm of Sunni Moslem criticism against the government. Sunni Moslems killed an army officer seeking to end a fight between Sunni and Shia Moslem villagers. The army in reprisal destroyed the Sunni village, causing a large number of Sunni casualties. News of the attack, which the army tried to keep out of the press, stirred violent popular reaction in the Basta quarter of Beirut, and large-scale demonstrations on 15 December were averted only by pressure from higher Moslem leaders. <redaction 1> Apparently, the army action was taken without the knowledge of Sunni Moslem Prime Minister and Minister of Defense Karami, but with the approval of President Shihab. This action has already resulted in an attack on the government by former rebel leader Abdullah Yafi and adverse press comment. Karami may attempt to shift the blame to the Christian minister of interior, Raymond Edde, which could cause serious dissension in the cabinet.", "redactions": ["Shia Moslem tribesmen employed in coastal areas left abruptly for the Biqa around 12 December on the orders of their leader. This move may be connected with the prevailing Shia-Sunni tension and could lead to further clashes."], "example_id": 9, "redacted_path": "images/9_redacted.png", "unredacted_path": "images/9_unredacted.png", "page": 12, "doc_id_r": "CIA-RDP79T00975A004200140001-9", "doc_id_u": 3000006, "date": "December 18, 1958"}
{"context": "New Afghan-Soviet Military Assistance Agreement May Be Concluded Afghan-Foreign Minister Naim, who left on 29 December for Moscow, apparently intends to conclude a new agreement to expand the Soviet military assistance program in Afghanistan. The Afghan Government may regard such a move as a calculated risk necessary to strengthen its position against what it regards as an increasingly unfavorable Western attitude toward Afghanistan. Afghanistan has been slow in training its troops to use Soviet weapons which have already been delivered. Any new military assistance agreement will therefore probably include an expanded training program, involving the use of additional Soviet military instructors. It would also provide for additional Soviet weapons, including heavy arms and more modern aircraft, The new agreement for a reported <redaction 1> would probably be financed by a long-term Soviet loan, ending the year-old Afghan policy of refusing to accept further loans in favor of grant aid. Because of discount prices, Afghanistan has apparently received bloc arms worth about <redaction 2> under the <redaction 3> and the <redaction 4>.", "redactions": ["$50,000,000", "$75,000,000", "$25,000,000 Soviet arms-assistance agreement signed in 1956", "$7,000,000,000 Czech arms agreement of 1954"], "example_id": 10, "redacted_path": "images/10_redacted.png", "unredacted_path": "images/10_unredacted.png", "page": 6, "doc_id_r": "CIA-RDP79T00975A004200230001-9", "doc_id_u": 3010223, "date": "December 30, 1958"}
{"context": "Paraguayan Opposition Elements Plan Revolt Another attack against the Paraguayan regime may be launched shortly from Argentina by left-wing opposition elements, who appear determined to maintain an atmosphere of unrest in Paraguay until one of their attacks coincides with sufficient military and popular discontent to overthrow President Stroessner. <redaction 1> The Communists, who have been trying to effect clandestine coordination of opposition activities, may also be involved. The plan, <redaction 2> calls for armed groups to cross from Argentina, a revolt by some military units controlled by junior officers favoring Mendez Fleitas, the assassination of Stroessner, and a popular uprising in Asuncion with strong student participation. The government, aware of the plot, has taken strong security precautions. An invasion attempt last October was discovered and prevented by Argentine police. While Stroessner has been sufficiently strong to quell such sorties, several soft spots in his military support have appeared. Moreover, plotting has increased since the successful revolution against military dictatorship in Venezuela a year ago and probably has been encouraged by the more recent successes of the Cuban rebels.", "redactions": ["In the short run this kind of plotting against the weak Stroessner regime may be more dangerous than it appears at first glance.", "airing by clandestine radio stations"], "example_id": 11, "redacted_path": "images/11_redacted.png", "unredacted_path": "images/11_unredacted.png", "page": 18, "doc_id_r": "CIA-RDP79T00975A004200260001-6", "doc_id_u": 3000013, "date": "January 3, 1959"}
{"context": "Moroccan Dissidents Step Up Activities Predominantly Berber elements in northern Morocco hostile to the dominant Istiqlal party--and especially to its left wing which took over the premiership and other important posts in the cabinet invested on 24 December--appear to have stepped up both the pace and the boldness of their dissident activities. Istiqlal's principal newspaper, Al Alam, has in recent days carried an increasing number of articles concerning violent incidents, and on 2 January it asserted that \"many attacks\" have been perpetrated against party offices and personnel as part of a foreign-supported plot against the party. <redaction 1> Concerned but apparently undaunted by this increasingly serious security problem, Premier Ibrahim's government has so far pursued an uncompromising, even provocative, course which could precipitate an early showdown between the contending forces. Immediately after its investiture a former Berber governor of an outlying province, who was forcibly removed and arrested in January 1957 for defying orders from Rabat and leading an abortive anti-Istiqlal revolt, was finally brought to trial. This led in turn to accusations that the chief \"plotter\" in the 1957 affair--which Istiqlal leaders claim was supported by France--was another and much more important Berber leader, Lahcen Lyoussi, a partisan of King Mohamed V and a crown counselor until his resignation was forced two weeks ago. The King, however, appears to have been fully aware of Lyoussi's complicity in the affair and, moreover, to have deliberately permitted him to leave Rabat following his resignation and to take refuge among his tribal followers in the Middle Atlas region. This action, coupled with the King's apparent protection of two other anti-Istiqlal leaders implicated in the present Berber dissidence, may hasten a reckoning between Mohamed V and republic-minded Istiqlal extremists. Meanwhile, elements of the royal army suspected of sympathizing with the local populations in the disaffected areas have been replaced by other, non-indigenous troops,", "redactions": ["[ paragraph break ]"], "example_id": 12, "redacted_path": "images/12_redacted.png", "unredacted_path": "images/12_unredacted.png", "page": 8, "doc_id_r": "CIA-RDP79T00975A004200270001-5", "doc_id_u": 3000014, "date": "January 5, 1959"}
{"context": "Soviet Economic Aid to Iraq A delegation of Soviet experts has arrived in Baghdad, according to a TASS report of 6 January, to discuss Soviet-Iraqi economic and technical cooperation with officials of the Iraqi Government. TASS did not specify what authority the delegation has to commit the Soviet Union to providing economic aid to Iraq, but the delegation is likely to offer at least economic assistance, probably in the form of a line of credit. Since the formation of the new Iraqi Government, the bloc has made a concentrated effort to develop economic as well as political relations with Baghdad to underscore the bloc's endorsement of the new regime. Most of the members of the Sino-Soviet bloc have signed trade agreements with Iraq. The Soviet Union has already concluded a <redaction 1> and has delivered three shiploads of military equipment to Iraq.", "redactions": ["$170,000,-000 arms deal"], "example_id": 13, "redacted_path": "images/13_redacted.png", "unredacted_path": "images/13_unredacted.png", "page": 7, "doc_id_r": "CIA-RDP79T00975A004200290001-3", "doc_id_u": 3000016, "date": "January 7, 1959"}
{"context": "Nasir's Anti-Communist Campaign Nasir's campaign against Communists throughout the UAR has reached major proportions. This campaign, unlike previous ones, has included arrests of prominent party members, and it would appear that Communist leadership has been severely crippled. Latest reports state that <redaction 1> have been arrested in Syria, including Mustafa Amin, one of the highest in the party. Also reportedly picked up was Abd al-Majid Jamal al-Din, a leader of the Syrian-Lebanese Communist party and head of the Syrian passports and immigration department. Khalid Bakdash, the Arab world's number-one Communist, reportedly has fled from Damascus to Baghdad. In Egypt, where Cairo newspapers are keeping up a constant barrage of criticism of Iraqi Communist activity, the number of arrests has exceeded 200, including several central committee members of Egypt's three Communist factions, as well as Communist members of the staff of the extreme leftist Cairo daily Al Misaa. Nasir <redaction 2> to follow up with a general purge of the press and a cleanup of the Egyptian State Broadcasting System and department of information. The arrests have not been publicized in the UAR, allegedly in order to avoid forewarning the Communists of the government's intentions. However, the regime has nearly always been reluctant to give local publicity to the existence of any organized opposition.", "redactions": ["about 550 members", "intends"], "example_id": 14, "redacted_path": "images/14_redacted.png", "unredacted_path": "images/14_unredacted.png", "page": 8, "doc_id_r": "CIA-RDP79T00975A004200300001-1", "doc_id_u": 3000017, "date": "January 8, 1959"}
{"context": "In the economic field, the British ambassador in Khartoum has reported that the Sudanese Government seems determined to maintain pricing practices which have resulted in very large cotton surpluses in previous years and which will place the Sudan in a particularly unfavorable position when British-UAR economic relations <redaction 1> 13 Jan 59 CENTRAL INTELLIGENCE BULLETIN Page <redaction 2> return to a normal basis. <redaction 3> the Soviet trade mission scheduled to arrive in Khartoum on 22 January may offer trade-aid deals difficult to resist. A Soviet offer related to Nile waters control projects would be particularly attractive.", "redactions": ["SECRET", "6", "An influential member of the cabinet has indicated that the government's policy is to rely on either the World Bank or the United States for external financial assistance for a development program. However,"], "example_id": 15, "redacted_path": "images/15_redacted.png", "unredacted_path": "images/15_unredacted.png", "page": 14, "doc_id_r": "CIA-RDP79T00975A004200340001-7", "doc_id_u": 3000020, "date": "January 13, 1959"}
{"context": "Spanish Aid to Moroccan Dissidents [Spanish involvement in the tribal dissidence in northern Morocco may cause Rabat to renew pressure for the evacuation of the 10,000 Spanish troops remaining in Morocco. Rabat has repeatedly protested Spanish complicity.] [Moroccan Vice Premier Bouabid, who with other officials recently inspected military activities in northern Morocco, stated <redaction 1> the Royal Army has proof that Spain has supplied arms and money to the Beni Ouriaghel tribe. Bouabid also claimed he has discovered a definite separatist movement in the Rif and that the Beni Ouriaghel--the tribe of Riffian warrior Abd-el-Krim who rebelled against Spain in the 1920s--apparently are determined to set up a Rif republic.] [The Spanish ambassador in Rabat has admitted that some assistance to the Moroccan tribes may have come from local Spanish sources, but he has denied that Spain intends to make war on Morocco. <redaction 2> ] [The Spanish military governor of Melilla, one of five tiny Spanish-controlled points in northern Morocco, is reported to have granted asylum to Berber leader Lahcen Lyoussi, a former crown counselor who is being sought by government forces for involvement in tribal dissidence, <redaction 3> is supporting tribal dissidence as a means of forcing Morocco to commit itself to recognizing Spain's sovereignty over its own present enclaves.]", "redactions": ["that", "\"intense Spanish activity\" throughout northern Morocco and the return to that area of many former Spanish native-affairs officers. Some of these officers may be considering--as they did during the French-imposed exile of the present King--the idea of establishing an autonomous northern Morocco.", "who, he believes,"], "example_id": 16, "redacted_path": "images/16_redacted.png", "unredacted_path": "images/16_unredacted.png", "page": 11, "doc_id_r": "CIA-RDP79T00975A004300450001-4", "doc_id_u": 3023339, "date": "January 21, 1959"}
{"context": "Khrushchev, Kekkonen Negotiate Soviet Premier Khrushchev, only five days before the Soviet party congress, has made a sudden trip to Leningrad, where Finnish President Kekkonen is making a \"private visit.\" Moscow appears to be making a special effort to conciliate the Finns after the prolonged period of Soviet pressures which last month toppled the Fagerholm coalition. The presence in Leningrad of both the Soviet and Finnish ministers of trade as well as Soviet Foreign Minister Gromyko indicates that trade as well as political discussions will take place. TASS announced that \"opinions on questions of Soviet-Finnish relations and some problems of the international situation\" had been discussed. Khrushchev probably now hopes to obtain a public Finnish endorsement for the specific Soviet proposals on Berlin and a German peace treaty. Finland had previously sent a prompt reply to Moscow favoring a conference on a German peace treaty. The communiqué issued after Kekkonen's state visit last May endorsed a nuclear-test ban, a Rapacki-type European disengagement zone, and \"universality\" in international organizations--the first time Finland had joined in such public statements. <redaction 1> The Finns are additionally concerned over the situation in the Baltic and German rearmament, which they believe could lead to a war inevitably involving Scandinavia. The USSR may also attempt to gain Finland's support for a Baltic \"zone of peace\"--a statement which Soviet leaders unsuccessfully \"pressed hard\" to include in the May communiqué. Mikoyan on 3 January in Copenhagen stated that he desired the Baltic \"to become a sea of peace.\"", "redactions": ["President Kekkonen and other Finnish officials reportedly feel that the USSR will, if necessary, use force to achieve its aims in Berlin and that Finland should meet Moscow \"halfway.\""], "example_id": 17, "redacted_path": "images/17_redacted.png", "unredacted_path": "images/17_unredacted.png", "page": 8, "doc_id_r": "CIA-RDP79T00975A004300430001-6", "doc_id_u": 2058871, "date": "January 23, 1959"}
{"context": "Japanese Conservatives Reach Compromise Prime Minister Kishi and his rivals in the governing Liberal-Democratic party have agreed to halt the factional struggle which has diminished conservative prestige and impeded Kishi's exercise of effective leadership. The principal factors behind the agreement appear to be concern for maintaining party unity in the face of a difficult Diet session beginning on 28 January and preventing possible losses in the upper house election in June. The terms of the compromise have not yet been revealed, but presumably involve a commitment by Kishi to give some of his rivals important cabinet or party posts in the near future in return for agreement to hold a party presidential election on 24 January. The prime minister's rivals, who had demanded that the party presidential elections be postponed until after Kishi's term expires on 21 March, have announced that they intend to nominate former Education Minister Kenzo Matsumura as a candidate to challenge Kishi. Although Kishi's re-election as party president seems assured, the compromise gives him only a temporary respite from <redaction 1>. Kishi probably will continue as prime minister at least until after the elections to the upper house next June. During the Diet session, he will probably concentrate on passing the budget and will avoid the introduction of controversial legislation, such as his bill to increase police powers. The opposition Socialists, encouraged by the defeat they administered to Kishi on the <redaction 2> during the last session and by the schism within <redaction 3>, will harass the government on every occasion. <redaction 4> the Socialists may carry out a <redaction 5>.", "redactions": ["the bitter factional struggle", "police-powers bill", "conservative ranks", "In particular", "plan to implicate Kishi in an alleged reparations scandal"], "example_id": 18, "redacted_path": "images/18_redacted.png", "unredacted_path": "images/18_unredacted.png", "page": 14, "doc_id_r": "CIA-RDP79T00975A004300430001-6", "doc_id_u": 2058871, "date": "January 23, 1959"}
{"context": "Friction Reported Among Thai Military Leaders\n\n[Friction between Thai Premier Marshal Sarit and his principal deputies, Generals Thanom and Prapat, appears to be growing. There is some danger that an estrangement may ensue which might upset the precarious stability within <redaction 1>dissatisfaction is increasing throughout Sarit's Revolutionary party-- which includes both military and civilian elements--over his performance as Thailand's dictator. Sarit is said again to be ignoring the party's advice on matters of state, and his continued delay in forming an interim government is meeting with criticism.]\n\n[Thanom and Prapat, who seem to have submerged their past differences, would prefer to avoid trouble since they expect that Sarit's declining health will soon force him to give up power. <redaction 2> He has apparently been piqued because they questioned certain of his official decisions. Some weeks ago, on the basis of rumors, he actually detained for a short time Air Marshal Dawee, a popular figure in the military group.]", "redactions": ["the ruling military group. It is also reported that ", "They may, however, feel forced to move against Sarit in self-defense. Recently he is reported to have drawn up orders for the arrest of Thanom and Prapat, only to tear them up a few minutes later."], "example_id": 19, "redacted_path": "images/19_redacted.png", "unredacted_path": "images/19_unredacted.png", "page": 14, "doc_id_r": "CIA-RDP79T00975A004300430001-6", "doc_id_u": 2058871, "date": "January 23, 1959"}
{"context": "Iranian-Soviet Nonaggression Pact Now Appears Certain [Iranian Minister of Court Ala told Ambassador Wailes in Tehran on 29 January that Iran has agreed to sign a nonaggression pact with the USSR. He also confirmed that three high-ranking Soviet officials, one of whom has been tentatively identified as A. P. Pavlov, chief of the Middle East Division of the Soviet Foreign Ministry, arrived in Tehran on the afternoon of 29 January.] [Further indication that significant developments are taking place in Iranian-Soviet negotiations is Soviet Ambassador Pegov's continued presence in Tehran despite local press reports that he was leaving for Moscow to attend the Communist party congress, a function from which Pegov, a member of the party central committee, would absent himself only for exceptionally pressing business. There are also reports of <redaction 1> between the Iranian Foreign Ministry and the Soviet Embassy in Tehran during the past few days, as well as of numerous meetings between Pegov and Iranian Ambassador-designate to Moscow Masud Ansuri.] [Ambassador Wailes regards the situation as serious and believes it has passed the stage of mere \"pressure...for budget assistance.\" He recently reported, however, that the Shah, realizing the serious consequences of signing any agreement with the USSR, may be trying to clarify vague Soviet proposals. In the Shah's present state of depression and apparent disillusionment, confused by conflicting advice from those around him and enticed by attractive Soviet offers, he may <redaction 2> a situation which is beyond his control.]", "redactions": ["\"intensive\" telephone traffic", "blunder into"], "example_id": 20, "redacted_path": "images/20_redacted.png", "unredacted_path": "images/20_unredacted.png", "page": 7, "doc_id_r": "CIA-RDP79T00975A004300370001-3", "doc_id_u": 3023332, "date": "January 30, 1959"}
{"context": "Nehru's Daughter Elected President of Indian Congress Party The election on 2 February of Prime Minister Nehru's 42-year-old daughter Indira Gandhi as president of the Congress party is unlikely to assure India's ruling political organization of the strong leadership it needs. The party lacks discipline and vitality at a time when implementation of India's development program and increasing competition from the Communist party demand its utmost effort. Mrs. Gandhi, wife of Parliament member Firoze Gandhi, apparently was supported by the Congress high command as well as by many regional party units. However, her election probably resulted less from enthusiasm for Mrs. Gandhi than from fear of displeasing Nehru and from lack of an alternative choice acceptable to all sections of the party. A few top leaders apparently did oppose her selection. Mrs. Gandhi has been actively associated with the \"ginger group\" in the party, which has been working, probably with Nehru's blessing, to revive the party's socialist ideology. The high command's somewhat surprising decision has the dual purpose of injecting \"young blood\" into the party leadership and checking the \"drift toward a rightist trend of thought.\" The naming of Indira Gandhi, however, could well have the opposite effect. <redaction 1> Congress bosses at the head of various regional party machines are not likely to be brought into line easily by Mrs. Gandhi, active in the high command only during the past few years, despite her unique position as Nehru's closest confidant. In addition, her identification with the party's left wing may alienate the more conservative elements and increase the possibility of an eventual party split.", "redactions": ["She lacks both the experience and the political leadership necessary for such a big job. Old-line"], "example_id": 21, "redacted_path": "images/21_redacted.png", "unredacted_path": "images/21_unredacted.png", "page": 17, "doc_id_r": "CIA-RDP79T00975A004300330001-7", "doc_id_u": 3003303, "date": "February 4, 1959"}
{"context": "New Saudi Pressure on ARAMCO Indicated (The Saudi Arabian Government's difficulties in strengthening its finances <redaction 1> are likely to result in increased pressure on the Arabian-American Oil Company (ARAMCO) to step up production to furnish additional revenues. Abdulla Tariki, the strongly nationalist director of petroleum affairs, has already indicated a desire to secure changes in the concession agreement, which he charged was \"rigged\" to maximize profits for ARAMCO's four parent companies in the United States which really make ARAMCO's policies. Tariki also indicated that he was considering opening discussions with German and Italian oil companies for concessions in the highly promising preferential zone, implying suspicion that ARAMCO's parent companies had discouraged other American oil companies from showing interest in meeting Saudi terms for concessions in this area. He added that the results of Venezuelan efforts to extract better terms from foreign oil companies would strongly influence the action of Arab countries.)", "redactions": ["by reducing allotments to the royal family"], "example_id": 22, "redacted_path": "images/22_redacted.png", "unredacted_path": "images/22_unredacted.png", "page": 9, "doc_id_r": "CIA-RDP79T00975A004300300001-0", "doc_id_u": 3023220, "date": "February 7, 1959"}
{"context": "Austrian Cabinet Declines Bid to Ban Communist-Front World Youth Festival A concerted effort to persuade the Austrian Government to withdraw its permission for the Communist-front World Youth Festival to convene in Vienna next July apparently has failed. <redaction 1> The only remaining possibility of preventing the Vienna meeting is to maneuver the preparatory committee itself into withdrawing.", "redactions": ["only Minister of Education Drimmel favored a ban on the festival when it was discussed at a cabinet meeting on 3 February, and further government consideration is unlikely."], "example_id": 23, "redacted_path": "images/23_redacted.png", "unredacted_path": "images/23_unredacted.png", "page": 16, "doc_id_r": "CIA-RDP79T00975A004300290001-2", "doc_id_u": 3023219, "date": "February 9, 1959"}
{"context": "Tension Surrounds Venezuelan Presidential Inauguration The explosive atmosphere surrounding the preparations for inauguration of Romulo Betancourt as president of Venezuela on 13 February is pointed up by serious mob violence in Caracas on 10 February and rumors of a coup attempt by dissident junior officers. The situation is complicated by the concentration of disorderly opposition elements in the politically strategic Federal District, where Betancourt has only limited support. Leaders of Betancourt's Democratic Action party (AD) have for some weeks feared disturbances, plots to block the inauguration, and even possible assassination attempts against the president-elect. There have been several incidents of mass opposition to Betancourt in Caracas since his electoral victory last December. The government is taking extensive precautions to protect visiting foreign delegations and to control any outbreaks of violence. Sources close to Betancourt are particularly concerned over the presence in Caracas of defeated presidential candidate Admiral <redaction 1> and doubt that his backers--who include the Communists--have fully accepted his defeat. Larrazabal, the popular former junta president, has kept himself in the political spotlight by appearances at public ceremonies, especially during the recent visit of Fidel Castro. There is some indication that he may postpone assuming his ambassadorial assignment in Chile until after the inauguration. His presence in Caracas on 13 February would be an embarrassment to Betancourt and could possibly provoke disorders.", "redactions": ["Wolfgang Larrazabal"], "example_id": 24, "redacted_path": "images/24_redacted.png", "unredacted_path": "images/24_unredacted.png", "page": 15, "doc_id_r": "CIA-RDP79T00975A004300260001-5", "doc_id_u": 3023216, "date": "February 12, 1959"}
{"context": "France to Propose Extension of NATO Area to Include Sahara The French Foreign and Defense ministries have drafted a proposal to extend the NATO area of responsibility to include the \"whole of the Sahara,\" <redaction 1> The French definition of \"Sahara\" appears to be in geographical terms, in view of De Gaulle's previous private allusions to extending the NATO area to the Sahara \"as far as the Red Sea.\" The new proposal stems from official French views that NATO is being outflanked to the south and that NATO support of France in North Africa, particularly in Algeria, is vital not only to France but to the whole Western world. French attitudes toward Egyptian President Nasir suggest that the proposal is also conceived in part as blocking further Egyptian influence. Premier Debré bluntly told Secretary Dulles on 6 February that unless France was backed in its Algerian policy it would retain its Mediterranean naval units \"separately.\" De Gaulle assured Dulles, however, that the French fleet would \"rush\" to NATO and become part of NATO forces in case of war. Algeria was removed from NATO military jurisdiction in 1954 at France's request.", "redactions": ["Paris reportedly intends to present this proposal initially to the United States and Britain, and then to the North Atlantic Council sometime after the 2-4 April meeting of NATO foreign ministers."], "example_id": 25, "redacted_path": "images/25_redacted.png", "unredacted_path": "images/25_unredacted.png", "page": 11, "doc_id_r": "CIA-RDP79T00975A004300250001-6", "doc_id_u": 3023215, "date": "February 13, 1959"}
{"context": "Soviet Views of Macmillan's Visit to Moscow\n\n{The Soviet leaders apparently believe that British views on Berlin and Germany and the likelihood of British elections this year can be exploited to weaken Western unity. The first <redaction 1> that the USSR considers Britain the \"weakest link\" in the Western front and may drive a \"hard bargain\" during Prime Minister Macmillan's visit. He hinted that the USSR might suggest withdrawing its Berlin demands in exchange for cancellation of plans for West German nuclear rearmament.}\n\n{Moscow probably feels that Macmillan's desire for a \"peacemaker\" role, together with the pressure of British public opinion for a lessening of East-West tensions, makes him particularly vulnerable on the German issue. <redaction 2>}\n\n{The Soviet leaders, reminded of the benefits former Prime Minister Eden derived in his 1955 election campaign from having advocated a summit meeting, may seek to obtain at least a tacit endorsement from Macmillan of the desirability of another heads-of-government conference and favorable reference to European security measures such as a nonaggression pact or a reduction of foreign forces in Germany. Soviet propaganda is stressing the British people's concern over trends in West Germany and their desire for a policy \"independent of that imposed by the Adenauer-Dulles partnership\".}", "redactions": ["secretary of the Soviet Embassy in Bonn implied to an American correspondent on 11 February", "The counselor of the Soviet Embassy in Paris has expressed doubts that Britain would participate in any Western military action to maintain land access to Berlin."], "example_id": 25, "redacted_path": "images/25_redacted.png", "unredacted_path": "images/25_unredacted.png", "page": 11, "doc_id_r": "CIA-RDP79T00975A004300250001-6", "doc_id_u": 3023215, "date": "February 13, 1959"}
{"context": "Cyprus Situation (If the London conference fails to achieve a settlement of the Cyprus issue because of Makarios' objections, an open break between the Greek Government and the Cypriot Ethnarchy is virtually certain. <redaction 1> will order the return of the Greek NATO contingent, withdrawn from Izmir last June, and will announce withdrawal of further support for the Greek Cypriot cause.) (A final break between Karamanlis and Makarios would have serious consequences on the Greek political scene, with both Communist and nationalist opposition parties demanding the government's resignation. Karamanlis' ability to survive would depend on the loyalty of the members of his own party in the Chamber of Deputies, where he enjoys a small majority.)", "redactions": ["Karamanlis recently stated that regardless of the results in London, Greece intends to maintain cordial relations with Turkey,"], "example_id": 27, "redacted_path": "images/27_redacted.png", "unredacted_path": "images/27_unredacted.png", "page": 10, "doc_id_r": "CIA-RDP79T00975A004300200001-1", "doc_id_u": 3023210, "date": "February 19, 1959"}
{"context": "Position of Guatemalan President Weakening (The Guatemalan political situation continues to deteriorate. <redaction 1> This, combined with the President's recent political blunders and a worsening economic situation due in part to a decline in income from coffee exports, has so weakened his position that his government may fall unless he acts quickly to clean it up. <redaction 2> (Ydigoras apparently realizes his danger and told the US ambassador on 18 February that he may have to \"crack down in a dictatorial manner!\" He also indicated that he intends to reshuffle his cabinet, dropping some of the members most identified by the public with graft.) (While there appears to be no immediate danger of a coup, since various opposition leaders are believed to be working at cross-purposes and the army remains loyal to the President, continuation of the present trend could within a relatively short time lead to his ouster. Key army officers, the ultimate locus of political power, have proven responsive to public pressure in the past, and their support of Ydigoras would probably be withdrawn if they became convinced that the President had lost his political and public backing.)", "redactions": ["The extreme venality among President Ydigoras' closest advisers, including members of his family, is receiving increasing public attention.", "Plotting to oust him is increasing among several groups ranging from the extreme right to the moderate left and now appears more widespread than at any time since he assumed office last March."], "example_id": 28, "redacted_path": "images/28_redacted.png", "unredacted_path": "images/28_unredacted.png", "page": 10, "doc_id_r": "CIA-RDP79T00975A004300190001-3", "doc_id_u": 3023209, "date": "February 20, 1959"}
{"context": "Moroccan Leader Returns to Re-enter Politics Abdelkhalek Torres, leader of the nationalist Islah party which merged with the ruling Istiqlal party in 1956, intends to resign as Moroccan ambassador to Cairo and return to active politics. Ostensibly an Istiqlal neutral but publicly siding with Allal el-Fassi in the latter's struggle with left-wing dissidents for control of the party, Torres plans to rebuild his personal following in northern Morocco, where anti-Istiqlal tribal disorders have occurred during the past five months. He also intends to enlarge his following in other areas. He claims that in the as-yet-unscheduled municipal elections he is certain of at least 25 percent of all municipal assembly seats. Torres' return to politics, opposed by left-wing Istiqlal Premier Ibrahim, apparently has the approval of King Mohamed V, who is concerned about instability in northern Morocco. <redaction 1> The King, who has resisted past Istiqlal attempts to install a one-party political system, seems to favor a two-party rather than a multi-party system and for that reason may not have sanctioned at this time the desire of many Torres followers to break away from Istiqlal. The King apparently discussed with Torres during an audience on 11 February the possibility of succeeding Premier Ibrahim, whose cabinet was installed in December as a stop-gap measure and was specifically charged with holding early municipal elections. American Ambassador Yost believes Torres is generally friendly to the West and would make a satisfactory premier. If invested as premier, Torres probably would follow the policy of his predecessors and demand the evacuation of foreign troops, including the American bases.", "redactions": ["Torres is reported to have demanded as his price for cooperation with the right wing a free hand in northern Morocco, early convocation of the postponed Istiqlal party congress, and adoption of a positive program. Should these conditions not be met, he probably would reconstitute the Islah party, which would further fragmentize Istiqlal and encourage a multiplicity of parties."], "example_id": 30, "redacted_path": "images/30_redacted.png", "unredacted_path": "images/30_unredacted.png", "page": 13, "doc_id_r": "CIA-RDP79T00975A004300160001-6", "doc_id_u": 3023207, "date": "February 24, 1959"}
{"context": "Laos Cabinet Decides to Terminate French Military Training Mission [The Laotian cabinet decided on 21 February to terminate the French military mission in Laos, apparently in order to pave the way for transferring the training function to US control. This decision underscores the government's determinaltion to act without reference to the restrictive provisions of the 1954 Geneva agreements which had previously given France exclusive control over military training in Laos.] [Prime Minister Phoui Sananikone told the American ambassador on 24 February that he hesitated to implement the cabinet's decision because he feared adverse French reaction. He may seek a formula under which France and the United States would share in training activities.] [Such a move by Laos would almost certainly be interpreted by Paris as US-instigated, and the strong French reaction would be heightened in view of the recent US-British-French talks concerning Southeast Asia. Although the French, <redaction 1> might threaten to withdraw their forces from Laos summarily, they first would probably lodge strong protests in Vientiane and Washington, seek support in London, and attempt to divert and modify the Lao move. The French Defense Council is scheduled to discuss augmentation of the French military contribution to Laos on 27 February.] [Public announcement of a shift in the training of the Laotian Army from French to US control would probably provoke intensified Communist diplomatic and propaganda pressures on Vientiane and would be cited as substantiation of Communist charges that the United States is attempting to turn Laos into a \"military base.\"]", "redactions": ["in an effort to embarrass the US,"], "example_id": 31, "redacted_path": "images/31_redacted.png", "unredacted_path": "images/31_unredacted.png", "page": 10, "doc_id_r": "CIA-RDP79T00975A004300140001-8", "doc_id_u": 3023206, "date": "February 26, 1959"}
{"context": "USSR - East Germany Khrushchev, during his visit to Berlin and Leipzig this week, will probably seek to use discussion on a separate peace treaty with East Germany to increase pressure for East-West summit talks on a peace treaty with both German states. The Soviet press attaché in East Berlin, <redaction 1>, has stated that a separate treaty would be negotiated but not signed during Khrushchev's visit. The East German news agency has reported that Ambassador Pervukhin on 1 March discussed the question of a peace treaty and the Berlin problem with Ulbricht and Grotewohl. The Kremlin has warned repeatedly since early February that it would conclude a separate treaty with the East German regime if no agreement were reached with the West on a treaty with the two Germanys. First Deputy Premier Mikoyan declared on 26 February that \"if the Western powers will not conclude a peace treaty with Germany, which would also solve the question of West Berlin as a free city,\" the Soviet Union and other countries \"will be compelled to sign a peace treaty\" with East Germany. While in Germany, Khrushchev will probably also discuss the transfer of Soviet quadripartite responsibilities in Berlin to the East Germans, particularly control over Allied military access to West Berlin.", "redactions": ["an official who is sometimes used to plant information"], "example_id": 32, "redacted_path": "images/32_redacted.png", "unredacted_path": "images/32_unredacted.png", "page": 7, "doc_id_r": "CIA-RDP79T00975A004300110001-1", "doc_id_u": 3023203, "date": "March 2, 1959"}
{"context": "Balkan Pact to be Discussed in Tito-Karamanlis Meeting Greek Premier Karamanlis <redaction 1> intends to press Tito at their meeting on 2 March for a definite yes or no on revival of the Balkan Pact in \"full vigor.\" <redaction 2> The Chief of the Greek General Staff, has counseled Karamanlis against such an approach to Tito, in the belief that the military relations between the two countries should not be stressed now and that a gradual evolution beginning in economic and cultural spheres would be more fruitful. The Yugoslavs are currently very sensitive on the question of the pact. They are especially afraid that revival of its military aspects would provide ammunition for the bloc's charges that Yugoslavia, contrary to its pretensions of remaining outside blocs, is tied to NATO by virtue of its membership in the Balkan Pact. Belgrade also feels that a publicized revival of the pact now would undermine the basic purpose of Tito's tour of the uncommitted countries, as an exponent of \"positive neutrality.\" For these reasons, Belgrade hopes to soft-pedal the military aspect of the pact but it wants to maintain and possibly even extend the pact's economic and cultural aspects. The pact, composed of Greece, Yugoslavia, and Turkey, was ratified in 1953 and became a formal military alliance in the following year. Since 1955, however, when hostility arose between Greece and Turkey over Cyprus, the pact's military committee has had little to do, and the pact organization has concerned itself primarily with economic and cultural matters. The recent Cyprus accord has removed a major obstacle to the pact's effectiveness and the recent worsening of Belgrade's relations with the bloc have made it seek improved ties with the West. While all three participants consider the continuance of the Balkan Pact to be in their interests, any renewed activity under the pact will probably not be publicized out of deference for Yugoslavia's difficult position.", "redactions": ["that the Balkan pact be pressed on Tito", "he intends to press Tito at their meeting on 2 March for a definite yes or no on revival of the Balkan Pact in \"full vigor.\""], "example_id": 33, "redacted_path": "images/33_redacted.png", "unredacted_path": "images/33_unredacted.png", "page": 11, "doc_id_r": "CIA-RDP79T00975A004300110001-1", "doc_id_u": 3023203, "date": "March 2, 1959"}
{"context": "Iraqi Communists Increase Pressure on Qasim Government The Iraqi Communists are attempting to cash in on the aftermath of the Mosul revolt by reiterating demands which would greatly increase their hold over the Qasim regime. These demands include a purge of the government and army, the execution of antiregime prisoners condemned by the \"people's court,\" the arming of the Communist-controlled Popular Resistance Forces, immediate withdrawal from the Baghdad Pact, and turning over key positions in all departments to those who are \"known\" to support the present regime and the \"only leader\" Qasim. These demands, \"which can no longer wait,\" are continually being broadcast over Communist-directed Baghdad radio, as well as appearing in the Communist press. Iraqi nationalist and pro-Nasir newspapers in Baghdad have been closed, and their printing equipment destroyed by the Communist-directed mob. <redaction 1> Many Baath party members have been arrested, and others are preparing to flee to Damascus. <redaction 2> On 12 March, Nasir followed up his anti-Communist speech of the previous day with an even stronger personal attack on Qasim. He expressed confidence that the Iraqi people would not long allow Qasim and his Communist \"masters\" to keep Iraq out of the Arab nationalist camp. He added that the UAR did not intend to retaliate against Iraqi \"provocation,\" such as the strafing of a Syrian village by Iraqi planes in pursuit of tribesmen fleeing the Mosul area. The UAR nevertheless is reported to have protested strongly to the Iraqi Government over the incident as well as over the ouster of its representatives in Baghdad. The UAR press is attacking Qasim from all angles, including allegations that his aims are in line with the Arab world's number-one enemy--Israel.", "redactions": ["[Pro-UAR elements are said to be in a state of panic, and former Baathist Minister of Development Fuad Rikabi is in hiding.", "Additional reports say the arrests have been extended to the army.]"], "example_id": 35, "redacted_path": "images/35_redacted.png", "unredacted_path": "images/35_unredacted.png", "page": 8, "doc_id_r": "CIA-RDP79T00975A004300010001-2", "doc_id_u": 3023194, "date": "March 13, 1959"}
{"context": "Overt French Military and Rightist Opposition to De Gaulle On Algeria Likely [There are indications that some die-hard elements in the French armed forces may join rightist civilian groups in openly opposing De Gaulle's Algerian policy. Army General Massu on 1 March, in his first \"political speech\" in recent months, described the May 1958 revolt by French military leaders in Algeria as \"an event of profound significance which still escapes many\" and referred pointedly to the integration of Algeria with France as one of its objectives. <redaction 1> There have been numerous army complaints recently that efforts to win the support of the mass of the Moslem population are severely handicapped by De Gaulle's continued refusal to espouse \"integration.\" ] [French military and rightist groups, who regard any proposed settlement of the Algerian problem short of complete victory as \"abandonment,\" are probably being spurred toward early action by leaks of De Gaulle's previously reported intention to hold a referendum in France on the question of continuing the war. There is increasing evidence that a majority of the public wants an end to the war and would probably support a \"liberal\" solution if De Gaulle proposed one. <redaction 2> ] [Extremist European settlers in Algeria, particularly veterans' organizations, have become openly hostile to De Gaulle, and are regrouping, as a result of the government's clemency measures toward Algerian rebels and of the announcement that the municipal elections in April will be conducted under a new law favoring Moslem candidates. Although De Gaulle's steps to split the military-settler front of 1958 had appeared successful, the settlers are continuing their efforts to regain military support and are likely to stage a major demonstration in Algiers on 22 March when Jouhaud decorates air force reservists there. ]", "redactions": ["Air Force Chief of Staff General Jouhaud, who was born in Algeria and played a leading role in the revolt, is reported to have made more visits to Algeria recently than his position warrants.", "Rumors of secret French-rebel contacts also have upset these military and rightist circles."], "example_id": 36, "redacted_path": "images/36_redacted.png", "unredacted_path": "images/36_unredacted.png", "page": 13, "doc_id_r": "CIA-RDP79T00975A004400050001-7", "doc_id_u": 3160622, "date": "March 19, 1959"}
{"context": "Morocco Indicates Desire to Purchase US Arms [Moroccan Defense Minister Mohamed Aouad inquired on 23 March whether the United States would supply some $19,000,000 to $23,000,000 worth of military equipment to modernize Morocco's 31,000-man army. Aouad said Morocco wants tanks, trucks, communications equipment, machine guns, submachine guns and ammunition, fighter and observation aircraft, and helicopters. He implied that the King is under considerable pressure--presumably from the left-wing members of the Ibrahim government--to continue to procure arms from the Soviet bloc, and indicated that the government has made a firm decision not to rely any longer on France as its primary source of materiel.<redaction 1>] [The more conservative Balafrej government, which had been unsuccessful in its efforts to obtain large quantities of light arms and ammunition and a munitions factory from Italy last year, had contracted for an unknown quantity of Czech arms. A part of this materiel--900 tons of light arms and ammunition--was delivered early in January; an unspecified amount of heavy equipment, according to Aouad, remains to be delivered.<redaction 2>] [Aouad's inquiry is a follow-up to a tentative approach he made earlier this year as well as an informal request made during the King's visit to Washington in November 1957. With much the same motivation as Tunisia, which will not consider arms procurement from France while the Algerian rebellion continues, Morocco probably would resist even a suggestion that it should continue to place primary reliance for its materiel on France, if only for the sake of standardization. The Moroccan approach probably will create new tensions in French-American relations and may complicate negotiations for the retention of the five American air bases in Morocco.<redaction 3>]", "redactions": ["]", "]", "]"], "example_id": 38, "redacted_path": "images/38_redacted.png", "unredacted_path": "images/38_unredacted.png", "page": 9, "doc_id_r": "CIA-RDP79T00975A004400110001-0", "doc_id_u": 3156027, "date": "March 26, 1959"}
{"context": "Castro's Policies Isolating Cuba in Latin America Fidel Castro's increasing tendency to blame the United States for Cuba's economic and political problems and to insist on a \"neutralist\" position in world affairs is widening the rift between Cuba and the liberal bloc in Latin America led by former Costa Rican President José Figueres and Venezuelan President Romulo Betancourt. Castro strongly refuted Figueres' pro-US speech in Havana on 22 March, in which Figueres advised Cuba to follow a moderate approach to revolutionary reforms and to align itself with the West. This undoubtedly spelled failure for any attempt by Figueres to orient Castro toward the Figueres-Betancourt axis--particularly with respect to the \"campaign against dictatorships!\"<redaction 1> Castro's reply to Figueres, which was followed by another strong attack against Figueres' views by the Cuban official newspaper Revolucion, may also encourage internal opposition to the Castro government by emphasizing Cuba's isolation from the Latin American liberal bloc. Many commercial and business groups have already been alienated by Castro's economic policies, which seem directed against \"vested interests\" and US influence on Cuba's economy. There is also discontent within some political circles, although there is as yet no cohesive opposition to the government.", "redactions": ["Figueres reportedly had hoped to convince Castro he should withdraw his support of those Nicaraguan and Dominican revolutionary exile groups which are Communist influenced."], "example_id": 39, "redacted_path": "images/39_redacted.png", "unredacted_path": "images/39_unredacted.png", "page": 10, "doc_id_r": "CIA-RDP79T00975A004400120001-9", "doc_id_u": 3156028, "date": "March 27, 1959"}
{"context": "Developments in Kuwait The growth of Communist influence in neighboring Iraq, together with last month's public call by Kuwaiti nationalists for an end to rule by the Subah family, have impressed the Subah sheikhs with their total dependence on British military protection. At the same time, the younger \"liberal\" Subahs have rallied in support of the family's old guard. Relations between the Kuwaiti Government and the British have grown more cordial than at any time in the last year, according to the American consul in Kuwait. The British military adviser's association with the British Government is no longer being played down by the Kuwaitis. Kuwaiti authorities have cracked down hard on anti-Qasim activity by pro-UAR Kuwaiti nationalists, and otherwise striven to avoid antagonizing Iraq. The main impetus to the curtailment of nationalist activity was the public attack on the Subah regime at a nationalist rally on 1 February honoring formation of the UAR. If the Subahs' firm repressive action is not followed by a meaningful attempt to liberalize the apparatus of government, however, the heretofore moderate nationalist opposition may be driven to advocate more uncompromising resistance. The Ruler of Kuwait has balanced his action by informing the Egyptian-dominated Arab League of readiness to contribute $14,000,000 to the Arab Economic Organization. While the pro-UAR nationalists have been temporarily brought under control, a Kuwaiti Government official has reported a sharp increase in complaints to the Ruler by Iraqis resident in Kuwait. The official fears that the pattern may reflect Communist inspiration, and the American consul comments that the Kuwaiti public security department is not adequately staffed for effective countersubversion work.", "redactions": [], "example_id": 40, "redacted_path": "images/40_redacted.png", "unredacted_path": "images/40_unredacted.png", "page": 10, "doc_id_r": "CIA-RDP79T00975A004400130001-8", "doc_id_u": 3156029, "date": "March 28, 1959"}
{"context": "Greek Elections (The United Democratic Left (EDA), legal front for the proscribed Communist party of Greece, is trying to make the municipal elections scheduled for 5 April a test of the pro-Western government's popularity.) (EDA leaders are seeking collaboration of non-Communist opposition parties in sponsoring joint slates of candidates for the municipal councils. While EDA has been rebuffed by spokesmen for several minor nationalist opposition parties, it apparently has achieved some success with Liberal leader Sophocles Venizelos. Venizelos, whose hatred of the government combined with his political opportunism make him a likely collaborator with the Communists, apparently has agreed to cooperate secretly with EDA in several municipalities. This co-operation, even if not effective in the council elections, may become evident in the subsequent election of mayors by the councilors.) (Venizelos, however, is spokesman for only one faction of the rapidly deteriorating Liberal party. Several prominent Liberals have denounced collaboration with EDA and are working with other nationalist leaders to defeat the Communists. This grouping may hold the balance of power in some cities if the elections result in approximately equal distribution of council seats between EDA and the government.) (The government favors holding \"nonpolitical\" elections, --emphasizing candidates rather than parties--apparently for fear that EDA, which captured 25 percent of the popular vote in the general elections in May 1958, has continued to gain strength among the electorate. EDA will probably gain new respectability from its association with the Venizelos wing of the Liberals. It will take credit for the victories of several non-Communist candidates and will probably increase its representation in local governments throughout Greece.)", "redactions": [], "example_id": 41, "redacted_path": "images/41_redacted.png", "unredacted_path": "images/41_unredacted.png", "page": 11, "doc_id_r": "CIA-RDP79T00975A004400150001-6", "doc_id_u": 3156030, "date": "March 31, 1959"}
{"context": "New Dutch Government Expected Soon A new Dutch coalition government, including Catholic, Protestant, and Liberal parties and headed by Catholic Prof. J. Dequay, is expected to be installed within the next week after over a month of negotiations. The Labor party, which precipitated the 12 March national elections by withdrawing from Prime Minister Drees' cabinet in December, now will be in the opposition. The new government will be further to the right than the Drees cabinet, in which elements of the Labor party exercised a moderating influence, and is even more deeply committed to Dutch retention of West New Guinea. It is prepared, if necessary, to weaken the Netherlands' contribution to NATO to support this stand and will probably protest more strongly against arms sales to Indonesia by the United States and other NATO countries. The <redaction 1> representative at a NATO committee meeting in Paris on 14 April, in fact, warned of severe political repercussions in The Hague if the United States proceeds with projected shipments of <redaction 2> to Indonesia and said, in off-the-record comments, that popular and parliamentary support for NATO would inevitably deteriorate. Defense build-up in West New Guinea, he said, would have to be at the expense of Dutch NATO commitments, since over-all defense expenditures are not likely to be increased. Further expression of Dutch resentment over Western deliveries of military items to Indonesia may be expected at the next NATO committee meeting on 21 April. As evidence of the danger of Indonesian aggression, the Dutch may produce a list of military items including parachutes, for which <redaction 3> is reported to have been shopping \"all over the world.\"", "redactions": ["Dutch", "C-130-B transports and other arms", "Djakarta"], "example_id": 43, "redacted_path": "images/43_redacted.png", "unredacted_path": "images/43_unredacted.png", "page": 12, "doc_id_r": "CIA-RDP79T00975A004400310001-8", "doc_id_u": 3156038, "date": "April 18, 1959"}
{"context": "France Considering Naval Action to Check Flow of Soviet Bloc Arms to Guinea (Paris is studying means, including interception at sea, to control the flow of Soviet bloc arms to Guinea, and intends to raise the matter in later Western tripartite talks on policy coordination, according to French officials participating in the current series of tripartite talks on Africa. French civilian and military officials in West Africa allege that Guinea, as part of an \"arms bargain\" with the bloc, is arming guerrilla bands for operations against neighboring states of the French Community) (High Paris officials, in arguing for closer Western policy coordination, have cited Guinea as a focal point for Communist penetration of Africa and as a potential security threat to its neighbors. In the tripartite talks, French representatives have characterized the area from France's southern coast to the equator as a single strategic zone of vital importance to French national interests.) (An initial gift shipment of military materiel from Czechoslovakia arrived in Conakry aboard a Polish ship on 18 March. <redaction 1> A subsequent Czech shipment including two or three light tanks and some army field kitchens, presumably part of the same gift arrangement, reportedly arrived late last week, also via a Polish vessel. In addition to re-equipping and perhaps expanding Guinea's present 2,000-man security force, Touré may assign some of this materiel to militant members of Guinea's single political party.) (Any Western interference with bloc shipments consigned to Guinea would be bitterly resented and vehemently protested by Touré and might make him even more receptive to close ties)", "redactions": ["It was reliably reported to include 8,000 rifles, 3,000 revolvers, 30 machine guns, 12 antitank guns, two armored cars, up to 60,000 grenades and 50 bazookas, 42 field radio sets, and approximately 150 tons of ammunition."], "example_id": 44, "redacted_path": "images/44_redacted.png", "unredacted_path": "images/44_unredacted.png", "page": 13, "doc_id_r": "CIA-RDP79T00975A004400350001-4", "doc_id_u": 3156039, "date": "April 23, 1959"}
{"context": "USSR and Nepal to Exchange Resident Diplomatic Missions TASS announced on 23 April that the USSR has reached agreement with Nepal to exchange resident diplomatic missions. Heretofore diplomatic contact has been maintained through the Soviet and Nepali embassies in New Delhi and by occasional trips to Katmandu by Soviet Ambassador Ponomarenko--accredited to Nepal as well as India--and other Soviet diplomats from New Delhi. <redaction 1> The USSR is breaking a \"gentlemen's agreement\" to postpone opening of a diplomatic mission in Nepal. The Indian Government, which regards Nepal as being within its sphere of influence, will not look with favor on this move. Should the United States accept the long-standing Nepali invitation to open an embassy in Katmandu, Communist China--which now has permission to open a consulate in Katmandu--can be expected to press for establishment of an embassy. A 20-man Soviet economic delegation has been in Nepal since mid-February negotiating on economic aid projects; Nepal has reportedly agreed to accept a Soviet credit of about $7,500,000 to construct a sugar mill, a hydroelectric plant, and communications projects, but an agreement has not yet been signed. (Ponomarenko is to visit Katmandu over the week end of 25-26 April, at which time he may seek to sign a formal agreement covering the aid.) Ponomarenko is being replaced as ambassador to India by I. A. Benediktov, who served in the post for five months in 1953. It is not known whether Benediktov will also be accredited to Katmandu or whether a resident ambassador will be appointed to head the new diplomatic mission there.", "redactions": ["(Ponomarenko informed the Indian Government on 20 April that such a move was pending and that the USSR had responded to \"Nepali overtures\"--an apparent effort to minimize New Delhi's reaction.)"], "example_id": 45, "redacted_path": "images/45_redacted.png", "unredacted_path": "images/45_unredacted.png", "page": 6, "doc_id_r": "CIA-RDP79T00975A004400360001-3", "doc_id_u": 3003310, "date": "April 24, 1959"}
{"context": "Panama Asks for US Help to Combat Invasion The Panamanian Government has requested US assistance against an armed invasion in a remote jungle area east of the northern entrance to the canal. The invasion appears to be part of the frequently reported plans of Roberto Arias, former ambassador to Britain, and Ruban Miro, implicated in the unsolved assassination of former President Remon, to oust President de la Guardia. They are believed to have recruited armed mercenaries in Cuba, although the Cuban Government assured De la Guardia it would not permit an expedition against him from its territory. Two of the invaders caught by the Panamanian National Guard were Cubans. Participants in other recent abortive revolts in Panama appear to have been in contact with Arias, who is accused of landing arms near Panama City on 20 April. He has taken asylum in the Brazilian Embassy in Panama City and may be given safe conduct out of the country. Miro was reported still to be trying to raise money and support in Cuba and the United States on 25 April. The revolutionary activities of their supporters may encourage some of De la Guardia's numerous other opponents, most of whom possess arms, to revolt. Political tension is already high over the imminent choice of 1960 presidential candidates, and rival cliques within the oligarchy have in the past manipulated dissident groups to help them gain the presidency. The guard, Panama's only armed force, has been De la Guardia's chief support against several previous attempts to oust him. <redaction 1> The revolutionary plans appear to call for its dispersal to various remote areas by scattered uprisings and reports of landings. The newly appointed minister of the interior can be expected to use the guard as effectively as possible, but it is primarily a poorly armed and trained urban police force which would be ineffective in jungle fighting. Panama's ambassador in Washington has been instructed to be prepared to submit the matter to the Organization of American States.", "redactions": ["The"], "example_id": 46, "redacted_path": "images/46_redacted.png", "unredacted_path": "images/46_unredacted.png", "page": 11, "doc_id_r": "CIA-RDP79T00975A004400380001-1", "doc_id_u": 3003312, "date": "April 27, 1959"}
{"context": "Tunisians Concerned Over Incidents on Algerian Border Tunisian officials are displaying concern over what appears to be an increase in the number and gravity of frontier incidents involving violations of Tunisian territory by French forces based in Algeria. Following a series of such incidents last month--including one in which a sizable number of French troops penetrated Tunisian territory to a depth of about 25 miles--Tunisian Foreign Secretary Mokaddem expressed fear on 27 April that the French military might be building up to a \"concentration of hostility\" against Tunisia. While there is no indication that any French elements are prepared at this time to provoke a major incident similar to last year's attack on the Tunisian border village of Sakiet Sidi Youssef, French Army units do appear to have become more active. This has been particularly noticeable in the southern desert region, where the French Army has taken an aggressive position in defending the \"rights\" of nomadic Algerian tribes which have traditionally moved freely in the barren and largely undemarcated border area. Early this year the Tunisians began cracking down on these tribesmen, whose incursions they believe are encouraged by French authorities in Algeria as part of France's effort to uphold its territorial claims in the area. These conflicting policies have already caused at least one dangerous confrontation of French and Tunisian military units and could easily lead to more serious trouble. To cope with these border problems--which also include the unsanctioned activities of Algerian rebels--Tunisia is expanding its army as rapidly as possible. It now reportedly has approximately 12,000 of a desired 20,000 men in uniform. However, these forces still suffer from serious materiel and logistic difficulties. On 27 April, President Bourguiba forwarded to the American Embassy in Tunis a new urgent request for the expeditious shipment of arms and, especially, military vehicles from the US.", "redactions": [], "example_id": 47, "redacted_path": "images/47_redacted.png", "unredacted_path": "images/47_unredacted.png", "page": 11, "doc_id_r": "CIA-RDP79T00975A004400420001-6", "doc_id_u": 3163331, "date": "May 1, 1959"}
{"context": "Communist Influence Growing in Cambodia [The increasingly apparent pro-Communist bias of the Cambodian press and other mass media, reflecting the pronounced leftist influence of the Information Ministry, is facilitating the steady growth of Sino-Soviet bloc influence in Cambodia. Cambodia now draws heavily on handouts supplied by international Communist news agencies. Recent editorials in influential newspapers have contained \"straight Communist textbook material,\" according to the American Embassy in Phnom Penh. Peiping, meanwhile, has given Cambodia powerful transmitters, is training two Cambodian radio supervisors in China, and is sending several technicians to Cambodia.] [The leftist trend has been accelerated recently by Communist exploitation of Cambodia's bitterness over Vietnamese and Thai involvement in plotting against the Sihanouk government, and Phnom Penh's attendant suspicion of American motives. In addition to an important asset in the person of crypto-Communist Secretary of State for Information Tim Dong, the Communists also benefit from <redaction 1> the Cambodian bureaucracy.]", "redactions": ["venality in"], "example_id": 48, "redacted_path": "images/48_redacted.png", "unredacted_path": "images/48_unredacted.png", "page": 14, "doc_id_r": "CIA-RDP79T00975A004400480001-0", "doc_id_u": 3153739, "date": "May 8, 1959"}
{"context": "Haitian President's Illness May Spark Serious Unrest The sudden serious illness of Haitian President Duvalier may endanger the tenuous political stability which has existed in Haiti since the abortive seven-man invasion attempt last July. The government has minimized the President's illness, but a medical specialist has been called in from the United States. Opposition elements, which have recently become increasingly active inside Haiti as well as abroad, may now be encouraged to move against the weak and unpopular regime. Although all leading opposition figures are in exile, dissident elements within the country, particularly the followers of former provisional president Daniel Fignolé, have recently engaged in organized acts of harassment, including strikes, against the government. The various groups might combine forces in an attempt to oust the government, but there undoubtedly would be a sharp struggle for power if the government should fall. An attempt to unify the opposition earlier this year failed. The Duvalier regime has long been almost totally dependent on the President's repressive security police for survival. The armed forces, weakened and alienated by a series of purges designed to eliminate officers of questionable loyalty to Duvalier, could not be relied on to support the government. A prolonged economic and financial crisis and inefficient administration have further weakened the government, and it seems doubtful that the regime could hold <redaction 1>.", "redactions": ["together if Duvalier's illness should spark serious disorders"], "example_id": 49, "redacted_path": "images/49_redacted.png", "unredacted_path": "images/49_unredacted.png", "page": 11, "doc_id_r": "CIA-RDP79T00975A004500150001-5", "doc_id_u": 3156042, "date": "May 28, 1959"}
{"context": "Indonesian Prime Minister Makes Thinly Veiled Threat of Army Coup Indonesia's Constituent Assembly, meeting in Bandung, was warned by Prime Minister Djuanda on 27 May that failure to readopt the 1945 constitution was likely to precipitate an army coup. The 1945 constitution strengthened the executive branch of government at the expense of the legislative, which is in line with Sukarno's concept of \"guided democracy.\" Although the necessary two-thirds majority in the Constituent Assembly is still uncertain, indications are increasing that the substantial and hitherto uncommitted vote--chiefly composed of the Moslem Nahdlatul Ulama--may support the government. A final vote is expected on 29 or 30 May. In addition to Djuanda's statement, <redaction 1> have hinted throughout the period of debate that if necessary they would take action to impose the constitution. Army Chief of Staff General Nasution held a national military conference during the final stages of debate, presumably to influence the assembly and possibly also to determine the support of regional commanders should extreme measures be required. The American Embassy notes that most civilian leaders of the government are absent from Djakarta. President Sukarno, Acting President Sartono, the prime minister, all three deputy prime ministers, and more than half a dozen cabinet ministers, including some of the most important, are away on missions, either within Indonesia or abroad. General Nasution and the principal army leaders, however, are on hand.", "redactions": ["army leaders"], "example_id": 50, "redacted_path": "images/50_redacted.png", "unredacted_path": "images/50_unredacted.png", "page": 9, "doc_id_r": "CIA-RDP79T00975A004500160001-4", "doc_id_u": 3163336, "date": "May 29, 1959"}
{"context": "Political Stalemate in Indonesia The Constituent Assembly's third rejection on 2 June of President Sukarno's proposal for the readoption of the 1945 constitution has created a political stalemate in Indonesia. Opposition to the constitution, under which both Sukarno and the army would gain increased political power at the expense of party activity, came from the Moslem parties, including the pivotal Nahdlatul Ulama party, which insisted on the incorporation of religious guarantees for the Islamic religion. The initiative now returns to President Sukarno and the army. Sukarno, now in the United States, will be met and briefed at his next major stop--Tokyo--probably on 6 June by Ruslan Abdulgani, head of the appointive national council and a Sukarno confidant. It has been speculated that the President's two-month world tour was timed to keep him uninvolved in the political maneuvers attending the constitutional debates and free to work out new arrangements if necessary. Although further attempts at compromise cannot be ruled out, army leaders have consistently hinted that they would take action to enforce the 1945 constitution if necessary, <redaction 1> <redaction 2> Nasution on 2 June banned all political activity, possibly as a preliminary move to further action. Prime Minister Djuanda had told the assembly that failure to accept the constitution might precipitate \"undesirable events\" similar to those which \"have taken place in neighboring countries\"--obviously a thinly veiled warning of an army take-over.", "redactions": ["Army Chief of Staff General Nasution was assured nationwide officer support for some such move", "and a threatening aspect of army preparations has been the open discussion of the possibility of a coup"], "example_id": 51, "redacted_path": "images/51_redacted.png", "unredacted_path": "images/51_unredacted.png", "page": 8, "doc_id_r": "CIA-RDP79T00975A004500200001-9", "doc_id_u": 3163338, "date": "June 3, 1959"}
{"context": "Indian Congress Party Plans Major Drive to Oust Communist Government in Kerala The Congress party branch in Kerala State plans, in cooperation with other groups opposing the Communist government there, to launch a major campaign on 12 June aimed at eventually forcing the Communists out of office. This drive is expected to tie in with separate agitation planned by the Hindu Nair and Catholic communities to begin on 15 June to protest the Communists' unpopular education policies. Leaders of these groups decided some time ago that when the annual school vacation ends in June they would refuse to reopen the large number of private schools under their control. (The <redaction 1> has instructed the Kerala branch not to participate officially in the school demonstrations, but has consented to the opposition front's political agitation on condition that it remain nonviolent. <redaction 2> has had some misgivings about the campaign, apparently because there is little assurance that the Congress party is strong enough to win the elections which would eventually follow ouster of the Communist government.) (Communist leaders have also shown growing concern over the planned demonstrations. They have put off the reopening date for schools from 1 June to 15 June and have appealed--apparently without success--for additional standby army contingents for use in an emergency. A section of the national Communist leadership reportedly argued at a recent party conclave in Kerala in favor of <redaction 3> of the Communist government, on grounds that its conduct had already had a detrimental effect on the party in the rest of India and that the forceful measures needed to contain the coming agitation would further damage Communist prestige.) A showdown in Kerala seems likely in the near future. Continued demonstrations by various groups may lead to violence, particularly if extremist agitators provoke Communist police units into using force. Serious disturbances could lead New Delhi to suspend <redaction 4> and invoke President's Rule.", "redactions": ["national leadership of the Congress party", "Prime Minister Nehru", "resignation", "parliamentary government in Kerala"], "example_id": 52, "redacted_path": "images/52_redacted.png", "unredacted_path": "images/52_unredacted.png", "page": 10, "doc_id_r": "CIA-RDP79T00975A004500250001-4", "doc_id_u": 3191544, "date": "June 9, 1959"}
{"context": "West Berlin Mayor Opposes Transferring Presidential Election (West Berlin's Mayor Willy Brandt informed American officials on 4 June that he was extremely concerned over reports that Bonn was planning to transfer the 1 July West German presidential election from Berlin to Bonn. He feels that since it had been announced that the election, as in 1954, would be held in Berlin, a reversal of plans now would be interpreted as a Western retreat and place a severe strain on West Berlin morale.) (Brandt was also distressed over reports that President Heuss would cancel his 17 June visit to West Berlin to open the reconstructed residence for the Federal President. He also complained that constant speculation on possible Western concessions at Geneva is hurting morale, and that West Berliners are giving more attention to \"discouraging\" press reports from Geneva.) Chancellor Adenauer has favored moving the election from Berlin to Bonn to avoid any possibility of incidents. <redaction 1> A majority of the CDU apparently shares Adenauer's view, but the opposition parties are attacking the government's hesitation and claiming Allied intervention is responsible. The final decision on convoking the National Assembly of 1,038 presidential electors is the legal responsibility of Bundestag President Gerstenmaier, who is reported to favor Berlin. <redaction 2> East Germany is attempting to exploit these differences by hinting at a temporary blockade of West German \"transport\" to the city if the elections are held in Berlin. East German propaganda chief Eisler claimed on 6 June that he had received proposals for such a blockade from East German workers. Eisler's additional hint of increased taxes on traffic to Berlin suggests that East Germany plans to make the election site the subject for a war of nerves, in the hope that Bonn's decision to hold the elections elsewhere could be presented as unwillingness to support West Berlin in the face of East German opposition. <redaction 3>", "redactions": ["A majority", "East Germany is attempting to exploit these differences by", "of East German opposition."], "example_id": 53, "redacted_path": "images/53_redacted.png", "unredacted_path": "images/53_unredacted.png", "page": 11, "doc_id_r": "CIA-RDP79T00975A004500250001-4", "doc_id_u": 3191544, "date": "June 9, 1959"}
{"context": "New Soviet Proposal for a \"Provisional Status\" for West Berlin After nearly two weeks of stalemated restricted sessions in Geneva, Foreign Minister Gromyko has offered to recognize certain drastically limited Western rights in Berlin for one year in a major bid to crack the hitherto unified Western position that any new solution must contain an explicit Soviet reaffirmation of Allied rights. The USSR seems to be estimating that unless there were some prospects of Western concessions on the issue of Allied rights, a summit meeting in the next few months would be less desirable than waiting for possible advantages which might be derived from an increase in political pressures on the British Government, <redaction 1>, and the continued erosion of the NATO military organization as a result of French national policies. Although the Soviet leaders undoubtedly expect rejection of their conditions, they probably hope that a combination of threats and inducements will prompt an initiative by at least one of the Allies to prevent a breakoff and a subsequent sharpening of the Berlin crisis. Gromyko had hinted at a compromise interim arrangement which would leave aside the deadlocked question of Western rights in Berlin for later negotiation, presumably at a summit meeting. However, on the possibility that further pressure might produce eventual if not immediate change in the Western position, each condition of the new Soviet package was tailored to take advantage of differences in Western willingness to make concessions on these points. Gromyko also threatened to conclude a separate peace treaty with East Germany should the West, during the one-year grace period, <redaction 2>.", "redactions": ["confusion and bitterness in West German politics resulting from Adenauer's decision to remain as chancellor,", "prevent agreement on an all-German peace treaty"], "example_id": 54, "redacted_path": "images/54_redacted.png", "unredacted_path": "images/54_unredacted.png", "page": 7, "doc_id_r": "CIA-RDP79T00975A004500270001-2", "doc_id_u": 3191546, "date": "June 11, 1959"}
{"context": "Costa Rican President's Neutrality in Nicaraguan Affair Leads <redaction 1> Frank Marshall, Costa Rican revolutionary veteran, warned President Echandi on 17 June that he has a substantial military force in the country ready to attack Nicaragua and that if Echandi attempts to stop it, \"there will be plenty of trouble in Costa Rica.\" The President immediately called in his cabinet and the leaders of various political parties. Fragmentary Costa Rican newscasts have subsequently indicated that, despite the threat, Echandi may be sending elements of the Civil Guard to prevent an attack on Nicaragua by Marshall. Echandi's efforts to maintain neutrality in the Nicaraguan affair have been highly unpopular in Costa Rica, where public opinion strongly backs the Nicaraguan opposition. Former President Jose Figueres' partisans, who dominate the legislature, have openly supported the Nicaraguan rebels and Figueres is believed to have aided the Nicaraguans who took part in the ill-fated invasions of 31 May and 1 June. However, Figueres could not back Marshall's threat without negating the basis of a political creed that has gained him wide prestige throughout the hemisphere. Marshall, <redaction 2> is capable of violent action, but would have little support for an attempt against the Costa Rican government. If Marshall's forces succeeded in invading Nicaragua they probably could not be themselves defeat the 5,000-man Nicaraguan National Guard. However, the Somoza regime is faced <redaction 3>", "redactions": ["To Threat Against His Government", "a rash and unstable man,", "with the threat of further incursions from Honduras in the north."], "example_id": 55, "redacted_path": "images/55_redacted.png", "unredacted_path": "images/55_unredacted.png", "page": 11, "doc_id_r": "CIA-RDP79T00975A004500330001-5", "doc_id_u": 3191550, "date": "June 18, 1959"}
{"context": "Cuban Air Force Purge Coincides With Rising Opposition To Regime Major Raul Castro, brother of the prime minister and chief of the Cuban armed forces, was responsible for the drastic air force purge which resulted in the dismissal of most of the force's rated pilots, <redaction 1> The purge, which became public knowledge on 18 June, also resulted in the replacement of Major Pedro Diaz Lanz as air force chief. Diaz Lanz, who was prominent among those officers seriously preoccupied with Communist penetration of the armed forces, is believed to have been particularly worried about the Communist influence in the recently established schools that have been giving six-week courses in political indoctrination to many Cuban military personnel. <redaction 2> The air force purge follows an important shake-up in army commands and reports of the discharge of army officers in several parts of the country. These moves reflect the regime's efforts to remove potential dissidents from the military. Rising opposition to the regime among other groups led during the week to the first significant wave of antigovernment terrorism since the fall of Batista last January and to increasing evidence of government fear of an imminent counterrevolutionary effort. The American army attaché in Cuba believes Raul Castro's frequent trips to eastern Cuba during the week may be related to fear of an attack from the Dominican Republic in retaliation for probable Cuban support of the 14 June rebel landings in that country. A knowledgeable Cuban exile in the Dominican Republic told an American Embassy officer in that country on 18 June that an armed Cuban exile force there was nearly ready to attack Cuba, but that he believes the attempt will probably fail.", "redactions": ["replacing the American-educated Major Pedro Diaz Lanz as air force chief.", "Diaz Lanz' half brother approached the US Embassy on 1 June for an opinion as to whether anti-Communist Cuban officers should go into exile or remain to resist Raul Castro's policies favoring the Communists."], "example_id": 56, "redacted_path": "images/56_redacted.png", "unredacted_path": "images/56_unredacted.png", "page": 12, "doc_id_r": "CIA-RDP79T00975A004500360001-2", "doc_id_u": 3191553, "date": "June 22, 1959"}
{"context": "British Labor Party Reconsidering Nuclear Policy (To avoid a Labor party split before the general elections expected this fall, party and trade-union leaders will meet on 23 June to seek ways of dealing with the growing pressure within the Labor movement to advocate a unilateral renunciation of nuclear weapons by Britain) (The meeting is being held a month earlier than originally scheduled, primarily to meet the threat posed by a resolution passed on 4 June by the powerful right-wing National Union of General and Municipal Workers, the third largest British trade union. This resolution calls for \"the next Labor government\" to stop the manufacture of nuclear weapons in Britain and prohibit their use on British territory. The Labor leadership apparently hopes to stave off a similar resolution from the Transport and General Workers Union--Britain's largest) (The present party policy, formulated in March 1958, merely calls on the government to press for an international agreement on the suspension of thermonuclear tests and to adopt a unilateral British test ban for one year. While Gaitskell, Bevan, and other party leaders continue to oppose any unilateral British nuclear disarmament, they are searching for measures which, while not limiting a future Labor government's freedom of action, will offer a contrast to the Macmillan government's policy. Bevan, for instance, favors a proposal that Britain should offer to give up its nuclear weapons to help form a non-nuclear \"club\" of all nations except the US and the USSR. He privately acknowledges, however, that Britain would not have to make good on its offer since France is unlikely to accept such a proposal.) (Even a slight shift in Labor party policy would bring additional pressure on the Macmillan government to achieve a test-suspension agreement. The government has continually shown its sensitivity to public opinion on the issue by seeking compromises for Soviet-Western differences on the subject.)", "redactions": [], "example_id": 57, "redacted_path": "images/57_redacted.png", "unredacted_path": "images/57_unredacted.png", "page": 11, "doc_id_r": "CIA-RDP79T00975A004500370001-1", "doc_id_u": 3191554, "date": "June 23, 1959"}
{"context": "Brazilians Considering Pressure Tactics in Bid for US Aid Ultranationalist advisors of President Kubitschek have drawn up an anti-US \"disaster plan,\" which they say will go into effect if Washington and the International Monetary Fund (IMF) continue to insist on a \"complete\" exchange reform as a condition of emergency balance-of-payments aid. <redaction 1> In the meantime, the ultranationalists plan to put pressure on the United States for direct aid by publicizing potential \"disaster\" measures, which include defaulting on international debts, denunciation of military treaties with the US, expropriation of certain private US holdings, and large-scale trade treaties with Soviet bloc countries. This publicity maneuver is strongly opposed by the foreign minister and the acting finance minister--both of whom hope for an amicable compromise solution. The American Embassy considers that this school of thought is \"for the moment\" in the ascendancy, but the embassy is uncertain as to the President's views. Kubitschek has grown increasingly irascible over the financial crisis and was reportedly enraged by publicity given this week to US Senate criticism of Brazil's financial policies. Kubitschek is under mounting domestic pressure to resolve the crisis, but is increasingly fearful that both his reputation and the stability of his government will be in danger if he adopts the measures demanded by the IMF. Social unrest, already high over sharp increases in the cost of living early this year, is expected to spread in the coming weeks as Communist and nationalist agitators prepare to demonstrate against utility and transportation rate increases announced for 1 July. The Communists will almost certainly claim that the increases were forced by the US and the IMF and will probably try to provoke violence.", "redactions": ["They told an American newsman that the government is planning new talks with the IMF, but that it does not plan any substantial revision of the exchange-reform program rejected by the IMF in late May."], "example_id": 58, "redacted_path": "images/58_redacted.png", "unredacted_path": "images/58_unredacted.png", "page": 12, "doc_id_r": "CIA-RDP79T00975A004500380001-0", "doc_id_u": 3163341, "date": "June 24, 1959"}
{"context": "The Caribbean Crisis The determination of leftists and liberals led by the Fidel Castro government of Cuba <redaction 1> to overthrow the Trujillo dictatorship in the Dominican Republic and the Somoza regime in Nicaragua has brought the contenders close to war. The situation also seriously threatens other governments, particularly the weak unpopular regime in Haiti. Military action has thus far been confined to rebel incursions into Nicaragua and the Dominican Republic, but may extend to counteraction by the beleaguered regimes against governments supporting the insurgents. Generalissimo Trujillo told the American ambassador on 20 June that \"defensive military action\" against Cuba will become \"imperative\" in the event of further insurgent landings. The armed forces chief of Nicaragua has also considered action against the hostile governments. Latin American Communists, who are particularly influential among the Cuban-backed rebel groups, would probably win influence in any postrevolutionary governments. The Communists are exploiting anti-dictator sentiment in the area and charge the US with attempting to crush popular democratic movements. <redaction 2> (The Organization of American States (OAS) faces the most serious crisis in its history. President Betancourt told the American ambassador on 23 June that the only alternative to war in the Caribbean and a fiasco for the OAS is the elimination of Trujillo. Venezuela, he said, will oppose any OAS consideration of the situation which, he feels, could only aid Trujillo.) Since 14 June, the Dominican Republic's 29-year-old Trujillo dictatorship <redaction 3> has been staggered by three Cuban-based rebel incursions, which appear to have involved up to 200 insurgents. Dominican officials privately admit \"substantial\" army losses. There are indications of collaboration with the rebels by local civilians and there may have been some army defections. Even if the initial incursions fail, as Trujillo", "redactions": ["and President Betancourt of Venezuela", "Former Costa Rican President Figueres, who backed the abortive early June attack on Nicaragua led by anti-Communists, now feels that \"all is lost to Communism\" in Nicaragua as the anti-Somoza forces turn to Cuba for support and accept Communist backing.", "--the hemisphere's most ruthless--"], "example_id": 59, "redacted_path": "images/59_redacted.png", "unredacted_path": "images/59_unredacted.png", "page": 11, "doc_id_r": "CIA-RDP79T00975A004500410001-6", "doc_id_u": 3191557, "date": "June 27, 1959"}
{"context": "Afghan-Soviet Bridge Construction Agreement Announced Afghanistan and the USSR on 18 July announced a new agreement under which Soviet technicians are to assist in the construction of three motor-road bridges in the eastern province of Ningrahar, near the Pakistani frontier. This activity would place Soviet personnel in the region opposite the Pakistani states of Chitral and Dir, which are subject to only limited and indirect control by Karachi, and near the sensitive Mohmand tribal area which lies astride the Afghan-Pakistani border. The projected bridges apparently are part of an Afghan Government program for road development in this region. This program is probably partly intended to facilitate the development of mineral and forest resources in the province. The restive local tribes have opposed this construction because such road development facilitates the extension of central government control in their territory. An Afghan district official was murdered in this area last December by Mohmands, one of the Pushtu tribes, and Kabul sent troops which suppressed the agitation and arrested a number of Mohmand leaders. Afghan Prime Minister Daud <redaction 1> He may intend the new agreement as a show of confidence in his ability to control the local tribes,", "redactions": ["was reported to suspect that Pakistan had a hand in this incident."], "example_id": 61, "redacted_path": "images/61_redacted.png", "unredacted_path": "images/61_unredacted.png", "page": 9, "doc_id_r": "CIA-RDP79T00975A004600190001-0", "doc_id_u": 3029875, "date": "July 22, 1959"}
